using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using Iris.DAL;
using Iris.Models;
using Iris.BPM;
using System.Data.Entity;

namespace Iris.Services
{
    public class RegAnathesiUniversalService : IRegAnathesiUniversalService, IDisposable
    {
        private readonly IrisDBEntities entities;

        public RegAnathesiUniversalService(IrisDBEntities entities)
        {
            this.entities = entities;
        }

        public IEnumerable<AnatheseisUniversalViewModel> Read(int schoolyearId = 0)
        {
            List<AnatheseisUniversalViewModel> data = new List<AnatheseisUniversalViewModel>();

            if (schoolyearId > 0)
            {
                data = (from d in entities.ΑΝΑΘΕΣΕΙΣ_ΚΑΘΟΛΙΚΟ
                        orderby d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ, d.ΣΧΟΛΙΚΟ_ΕΤΟΣ, d.ΕΠΩΝΥΜΙΑ
                        where d.ΣΧΟΛΙΚΟ_ΕΤΟΣ == schoolyearId
                        select new AnatheseisUniversalViewModel
                        {
                            ID = d.ID,
                            ΣΧΟΛ_ΕΤΟΣ = d.ΣΧΟΛ_ΕΤΟΣ,
                            ΕΠΩΝΥΜΙΑ = d.ΕΠΩΝΥΜΙΑ,
                            ΜΟΝΑΔΑ = d.ΜΟΝΑΔΑ,
                            ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ = d.ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΑΦΜ = d.ΑΦΜ,
                            ΟΝΟΜΑΤΕΠΩΝΥΜΟ = d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ,
                            ΕΙΔΙΚΟΤΗΤΑ = d.ΕΙΔΙΚΟΤΗΤΑ,
                            ΚΛΑΔΟΣ = d.ΚΛΑΔΟΣ,
                            ΩΡΕΣ_ΕΒΔ = d.ΩΡΕΣ_ΕΒΔ,
                            ΩΡΟΜΙΣΘΙΟ = d.ΩΡΟΜΙΣΘΙΟ,
                            ΣΥΜΒΑΣΗ_ΕΙΔΟΣ = d.ΣΥΜΒΑΣΗ_ΕΙΔΟΣ,
                            ΑΠΟΦΑΣΗ_ΕΙΔΟΣ = d.ΑΠΟΦΑΣΗ_ΕΙΔΟΣ,
                            ΗΜΝΙΑ_ΣΥΝΤΑΞΗ = d.ΗΜΝΙΑ_ΣΥΝΤΑΞΗ,
                            ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ = d.ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ ?? "ΣΧΕΔΙΟ ΕΓΓΡΑΦΟΥ",
                            ΔΙΑΧΕΙΡΙΣΤΗΣ = d.ΔΙΑΧΕΙΡΙΣΤΗΣ,
                            ΣΧΟΛΗ = d.ΣΧΟΛΗ,
                            ΣΧΟΛΙΚΟ_ΕΤΟΣ = d.ΣΧΟΛΙΚΟ_ΕΤΟΣ,
                            ΚΛΑΔΟΣ_ΚΩΔ = d.ΚΛΑΔΟΣ_ΚΩΔ,
                            ΣΥΜΒΑΣΗ = d.ΣΥΜΒΑΣΗ,
                            ΦΥΛΟ = d.ΦΥΛΟ,
                            ΩΡΟΜΙΣΘΙΟ_ΚΩΔ = d.ΩΡΟΜΙΣΘΙΟ_ΚΩΔ,
                            ΑΠΟΦΑΣΗ_ΚΩΔ = d.ΑΠΟΦΑΣΗ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ = d.ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ,
                            ΔΟΜΗ = d.ΔΟΜΗ,
                            ΚΩΔΙΚΟΣ_ΠΕΡΙΦΕΡΕΙΑ = d.ΚΩΔΙΚΟΣ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ = d.ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ,
                            ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ = d.ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ,
                            ΦΥΛΟ_ΚΩΔ = d.ΦΥΛΟ_ΚΩΔ,
                            ΩΡΕΣ_34ΕΒΔ = d.ΩΡΕΣ_34ΕΒΔ,
                            ΠΟΣΟ_34ΕΒΔ = d.ΠΟΣΟ_34ΕΒΔ
                        }).ToList();
            }
            else
            {
                data = (from d in entities.ΑΝΑΘΕΣΕΙΣ_ΚΑΘΟΛΙΚΟ
                        orderby d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ, d.ΣΧΟΛΙΚΟ_ΕΤΟΣ, d.ΕΠΩΝΥΜΙΑ
                        select new AnatheseisUniversalViewModel
                        {
                            ID = d.ID,
                            ΣΧΟΛ_ΕΤΟΣ = d.ΣΧΟΛ_ΕΤΟΣ,
                            ΕΠΩΝΥΜΙΑ = d.ΕΠΩΝΥΜΙΑ,
                            ΜΟΝΑΔΑ = d.ΜΟΝΑΔΑ,
                            ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ = d.ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΑΦΜ = d.ΑΦΜ,
                            ΟΝΟΜΑΤΕΠΩΝΥΜΟ = d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ,
                            ΕΙΔΙΚΟΤΗΤΑ = d.ΕΙΔΙΚΟΤΗΤΑ,
                            ΚΛΑΔΟΣ = d.ΚΛΑΔΟΣ,
                            ΩΡΕΣ_ΕΒΔ = d.ΩΡΕΣ_ΕΒΔ,
                            ΩΡΟΜΙΣΘΙΟ = d.ΩΡΟΜΙΣΘΙΟ,
                            ΣΥΜΒΑΣΗ_ΕΙΔΟΣ = d.ΣΥΜΒΑΣΗ_ΕΙΔΟΣ,
                            ΑΠΟΦΑΣΗ_ΕΙΔΟΣ = d.ΑΠΟΦΑΣΗ_ΕΙΔΟΣ,
                            ΗΜΝΙΑ_ΣΥΝΤΑΞΗ = d.ΗΜΝΙΑ_ΣΥΝΤΑΞΗ,
                            ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ = d.ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ ?? "ΣΧΕΔΙΟ ΕΓΓΡΑΦΟΥ",
                            ΔΙΑΧΕΙΡΙΣΤΗΣ = d.ΔΙΑΧΕΙΡΙΣΤΗΣ,
                            ΣΧΟΛΗ = d.ΣΧΟΛΗ,
                            ΣΧΟΛΙΚΟ_ΕΤΟΣ = d.ΣΧΟΛΙΚΟ_ΕΤΟΣ,
                            ΚΛΑΔΟΣ_ΚΩΔ = d.ΚΛΑΔΟΣ_ΚΩΔ,
                            ΣΥΜΒΑΣΗ = d.ΣΥΜΒΑΣΗ,
                            ΦΥΛΟ = d.ΦΥΛΟ,
                            ΩΡΟΜΙΣΘΙΟ_ΚΩΔ = d.ΩΡΟΜΙΣΘΙΟ_ΚΩΔ,
                            ΑΠΟΦΑΣΗ_ΚΩΔ = d.ΑΠΟΦΑΣΗ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ = d.ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ,
                            ΔΟΜΗ = d.ΔΟΜΗ,
                            ΚΩΔΙΚΟΣ_ΠΕΡΙΦΕΡΕΙΑ = d.ΚΩΔΙΚΟΣ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ = d.ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ,
                            ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ = d.ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ,
                            ΦΥΛΟ_ΚΩΔ = d.ΦΥΛΟ_ΚΩΔ,
                            ΩΡΕΣ_34ΕΒΔ = d.ΩΡΕΣ_34ΕΒΔ,
                            ΠΟΣΟ_34ΕΒΔ = d.ΠΟΣΟ_34ΕΒΔ
                        }).ToList();
            }
            return data;
        }

        public AnatheseisUniversalViewModel GetRecord(int entityId)
        {
            var data = (from d in entities.ΑΝΑΘΕΣΕΙΣ_ΚΑΘΟΛΙΚΟ
                        where d.ID == entityId
                        select new AnatheseisUniversalViewModel
                        {
                            ID = d.ID,
                            ΣΧΟΛ_ΕΤΟΣ = d.ΣΧΟΛ_ΕΤΟΣ,
                            ΕΠΩΝΥΜΙΑ = d.ΕΠΩΝΥΜΙΑ,
                            ΜΟΝΑΔΑ = d.ΜΟΝΑΔΑ,
                            ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ = d.ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΑΦΜ = d.ΑΦΜ,
                            ΟΝΟΜΑΤΕΠΩΝΥΜΟ = d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ,
                            ΕΙΔΙΚΟΤΗΤΑ = d.ΕΙΔΙΚΟΤΗΤΑ,
                            ΚΛΑΔΟΣ = d.ΚΛΑΔΟΣ,
                            ΩΡΕΣ_ΕΒΔ = d.ΩΡΕΣ_ΕΒΔ,
                            ΩΡΟΜΙΣΘΙΟ = d.ΩΡΟΜΙΣΘΙΟ,
                            ΣΥΜΒΑΣΗ_ΕΙΔΟΣ = d.ΣΥΜΒΑΣΗ_ΕΙΔΟΣ,
                            ΑΠΟΦΑΣΗ_ΕΙΔΟΣ = d.ΑΠΟΦΑΣΗ_ΕΙΔΟΣ,
                            ΗΜΝΙΑ_ΣΥΝΤΑΞΗ = d.ΗΜΝΙΑ_ΣΥΝΤΑΞΗ,
                            ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ = d.ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ,
                            ΔΙΑΧΕΙΡΙΣΤΗΣ = d.ΔΙΑΧΕΙΡΙΣΤΗΣ,
                            ΣΧΟΛΗ = d.ΣΧΟΛΗ,
                            ΣΧΟΛΙΚΟ_ΕΤΟΣ = d.ΣΧΟΛΙΚΟ_ΕΤΟΣ,
                            ΚΛΑΔΟΣ_ΚΩΔ = d.ΚΛΑΔΟΣ_ΚΩΔ,
                            ΣΥΜΒΑΣΗ = d.ΣΥΜΒΑΣΗ,
                            ΦΥΛΟ = d.ΦΥΛΟ,
                            ΩΡΟΜΙΣΘΙΟ_ΚΩΔ = d.ΩΡΟΜΙΣΘΙΟ_ΚΩΔ,
                            ΑΠΟΦΑΣΗ_ΚΩΔ = d.ΑΠΟΦΑΣΗ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ = d.ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ,
                            ΔΟΜΗ = d.ΔΟΜΗ,
                            ΚΩΔΙΚΟΣ_ΠΕΡΙΦΕΡΕΙΑ = d.ΚΩΔΙΚΟΣ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ = d.ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ,
                            ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ = d.ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ,
                            ΦΥΛΟ_ΚΩΔ = d.ΦΥΛΟ_ΚΩΔ,
                            ΩΡΕΣ_34ΕΒΔ = d.ΩΡΕΣ_34ΕΒΔ,
                            ΠΟΣΟ_34ΕΒΔ = d.ΠΟΣΟ_34ΕΒΔ
                        }).FirstOrDefault();
            return data;
        }

        public void Dispose()
        {
            entities.Dispose();
        }
    }
}