using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using Iris.DAL;
using Iris.Models;
using Iris.BPM;
using System.Data.Entity;

namespace Iris.Services
{
    public class RegAnathesiProslipsiService : IRegAnathesiProslipsiService, IDisposable
    {
        private readonly IrisDBEntities entities;

        public RegAnathesiProslipsiService(IrisDBEntities entities)
        {
            this.entities = entities;
        }

        public IEnumerable<RegAnathesiProslipsiViewModel> ReadEpas(int schoolyearId = 0)
        {
            List<RegAnathesiProslipsiViewModel> data = new List<RegAnathesiProslipsiViewModel>();

            if (schoolyearId > 0)
            {
                data = (from d in entities.regΑΝΑΘΕΣΕΙΣ_ΠΡΟΣΛΗΨΗ
                        orderby d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ, d.ΣΧΟΛΙΚΟ_ΕΤΟΣ, d.ΕΠΩΝΥΜΙΑ
                        where d.ΣΧΟΛΙΚΟ_ΕΤΟΣ == schoolyearId && (d.ΜΟΝΑΔΑ == "ΕΠΑΣ" || d.ΜΟΝΑΔΑ == "ΠΕΠΑΣ")
                        select new RegAnathesiProslipsiViewModel
                        {
                            ID = d.ID,
                            ΣΧΟΛ_ΕΤΟΣ = d.ΣΧΟΛ_ΕΤΟΣ,
                            ΕΠΩΝΥΜΙΑ = d.ΕΠΩΝΥΜΙΑ,
                            ΜΟΝΑΔΑ = d.ΜΟΝΑΔΑ,
                            ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ = d.ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΑΦΜ = d.ΑΦΜ,
                            ΟΝΟΜΑΤΕΠΩΝΥΜΟ = d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ,
                            ΕΙΔΙΚΟΤΗΤΑ = d.ΕΙΔΙΚΟΤΗΤΑ,
                            ΚΛΑΔΟΣ = d.ΚΛΑΔΟΣ,
                            ΩΡΕΣ_ΕΒΔ = d.ΩΡΕΣ_ΕΒΔ,
                            ΩΡΟΜΙΣΘΙΟ = d.ΩΡΟΜΙΣΘΙΟ,
                            ΦΥΛΟ_ΛΕΚΤΙΚΟ = d.ΦΥΛΟ_ΛΕΚΤΙΚΟ,
                            ΣΥΜΒΑΣΗ_ΕΙΔΟΣ = d.ΣΥΜΒΑΣΗ_ΕΙΔΟΣ,
                            ΑΠΟΦΑΣΗ_ΕΙΔΟΣ = d.ΑΠΟΦΑΣΗ_ΕΙΔΟΣ,
                            ΗΜΝΙΑ_ΣΥΝΤΑΞΗ = d.ΗΜΝΙΑ_ΣΥΝΤΑΞΗ,
                            ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ = d.ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ,
                            ΔΙΑΧΕΙΡΙΣΤΗΣ = d.ΔΙΑΧΕΙΡΙΣΤΗΣ,
                            ΠΑΤΡΩΝΥΜΟ = d.ΠΑΤΡΩΝΥΜΟ,
                            ΣΧΟΛΗ = d.ΣΧΟΛΗ,
                            ΣΧΟΛΙΚΟ_ΕΤΟΣ = d.ΣΧΟΛΙΚΟ_ΕΤΟΣ,
                            ΚΛΑΔΟΣ_ΚΩΔ = d.ΚΛΑΔΟΣ_ΚΩΔ,
                            ΣΥΜΒΑΣΗ = d.ΣΥΜΒΑΣΗ,
                            ΦΥΛΟ = d.ΦΥΛΟ,
                            ΩΡΟΜΙΣΘΙΟ_ΚΩΔ = d.ΩΡΟΜΙΣΘΙΟ_ΚΩΔ,
                            ΑΝΑΘΕΣΗ_ΚΩΔ = d.ΑΝΑΘΕΣΗ_ΚΩΔ,
                            ΑΠΟΦΑΣΗ_ΚΩΔ = d.ΑΠΟΦΑΣΗ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ = d.ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ = d.ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ,
                            ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ = d.ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ
                        }).ToList();
            }
            else
            {
                data = (from d in entities.regΑΝΑΘΕΣΕΙΣ_ΠΡΟΣΛΗΨΗ
                        orderby d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ, d.ΣΧΟΛΙΚΟ_ΕΤΟΣ, d.ΕΠΩΝΥΜΙΑ
                        where d.ΜΟΝΑΔΑ == "ΕΠΑΣ" || d.ΜΟΝΑΔΑ == "ΠΕΠΑΣ"
                        select new RegAnathesiProslipsiViewModel
                        {
                            ID = d.ID,
                            ΣΧΟΛ_ΕΤΟΣ = d.ΣΧΟΛ_ΕΤΟΣ,
                            ΕΠΩΝΥΜΙΑ = d.ΕΠΩΝΥΜΙΑ,
                            ΜΟΝΑΔΑ = d.ΜΟΝΑΔΑ,
                            ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ = d.ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΑΦΜ = d.ΑΦΜ,
                            ΟΝΟΜΑΤΕΠΩΝΥΜΟ = d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ,
                            ΕΙΔΙΚΟΤΗΤΑ = d.ΕΙΔΙΚΟΤΗΤΑ,
                            ΚΛΑΔΟΣ = d.ΚΛΑΔΟΣ,
                            ΩΡΕΣ_ΕΒΔ = d.ΩΡΕΣ_ΕΒΔ,
                            ΩΡΟΜΙΣΘΙΟ = d.ΩΡΟΜΙΣΘΙΟ,
                            ΦΥΛΟ_ΛΕΚΤΙΚΟ = d.ΦΥΛΟ_ΛΕΚΤΙΚΟ,
                            ΣΥΜΒΑΣΗ_ΕΙΔΟΣ = d.ΣΥΜΒΑΣΗ_ΕΙΔΟΣ,
                            ΑΠΟΦΑΣΗ_ΕΙΔΟΣ = d.ΑΠΟΦΑΣΗ_ΕΙΔΟΣ,
                            ΗΜΝΙΑ_ΣΥΝΤΑΞΗ = d.ΗΜΝΙΑ_ΣΥΝΤΑΞΗ,
                            ΠΑΤΡΩΝΥΜΟ = d.ΠΑΤΡΩΝΥΜΟ,
                            ΣΧΟΛΗ = d.ΣΧΟΛΗ,
                            ΣΧΟΛΙΚΟ_ΕΤΟΣ = d.ΣΧΟΛΙΚΟ_ΕΤΟΣ,
                            ΚΛΑΔΟΣ_ΚΩΔ = d.ΚΛΑΔΟΣ_ΚΩΔ,
                            ΣΥΜΒΑΣΗ = d.ΣΥΜΒΑΣΗ,
                            ΦΥΛΟ = d.ΦΥΛΟ,
                            ΩΡΟΜΙΣΘΙΟ_ΚΩΔ = d.ΩΡΟΜΙΣΘΙΟ_ΚΩΔ,
                            ΑΝΑΘΕΣΗ_ΚΩΔ = d.ΑΝΑΘΕΣΗ_ΚΩΔ,
                            ΑΠΟΦΑΣΗ_ΚΩΔ = d.ΑΠΟΦΑΣΗ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ = d.ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ = d.ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ,
                            ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ = d.ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ
                        }).ToList();
            }
            return data;
        }

        public IEnumerable<RegAnathesiProslipsiViewModel> ReadIek(int schoolyearId = 0)
        {
            List<RegAnathesiProslipsiViewModel> data = new List<RegAnathesiProslipsiViewModel>();

            if (schoolyearId > 0)
            {
                data = (from d in entities.regΑΝΑΘΕΣΕΙΣ_ΠΡΟΣΛΗΨΗ
                        orderby d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ, d.ΣΧΟΛΙΚΟ_ΕΤΟΣ, d.ΕΠΩΝΥΜΙΑ
                        where d.ΣΧΟΛΙΚΟ_ΕΤΟΣ == schoolyearId && (d.ΜΟΝΑΔΑ != "ΕΠΑΣ" && d.ΜΟΝΑΔΑ != "ΠΕΠΑΣ")
                        select new RegAnathesiProslipsiViewModel
                        {
                            ID = d.ID,
                            ΣΧΟΛ_ΕΤΟΣ = d.ΣΧΟΛ_ΕΤΟΣ,
                            ΕΠΩΝΥΜΙΑ = d.ΕΠΩΝΥΜΙΑ,
                            ΜΟΝΑΔΑ = d.ΜΟΝΑΔΑ,
                            ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ = d.ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΑΦΜ = d.ΑΦΜ,
                            ΟΝΟΜΑΤΕΠΩΝΥΜΟ = d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ,
                            ΕΙΔΙΚΟΤΗΤΑ = d.ΕΙΔΙΚΟΤΗΤΑ,
                            ΚΛΑΔΟΣ = d.ΚΛΑΔΟΣ,
                            ΩΡΕΣ_ΕΒΔ = d.ΩΡΕΣ_ΕΒΔ,
                            ΩΡΟΜΙΣΘΙΟ = d.ΩΡΟΜΙΣΘΙΟ,
                            ΦΥΛΟ_ΛΕΚΤΙΚΟ = d.ΦΥΛΟ_ΛΕΚΤΙΚΟ,
                            ΣΥΜΒΑΣΗ_ΕΙΔΟΣ = d.ΣΥΜΒΑΣΗ_ΕΙΔΟΣ,
                            ΑΠΟΦΑΣΗ_ΕΙΔΟΣ = d.ΑΠΟΦΑΣΗ_ΕΙΔΟΣ,
                            ΗΜΝΙΑ_ΣΥΝΤΑΞΗ = d.ΗΜΝΙΑ_ΣΥΝΤΑΞΗ,
                            ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ = d.ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ,
                            ΔΙΑΧΕΙΡΙΣΤΗΣ = d.ΔΙΑΧΕΙΡΙΣΤΗΣ,
                            ΠΑΤΡΩΝΥΜΟ = d.ΠΑΤΡΩΝΥΜΟ,
                            ΣΧΟΛΗ = d.ΣΧΟΛΗ,
                            ΣΧΟΛΙΚΟ_ΕΤΟΣ = d.ΣΧΟΛΙΚΟ_ΕΤΟΣ,
                            ΚΛΑΔΟΣ_ΚΩΔ = d.ΚΛΑΔΟΣ_ΚΩΔ,
                            ΣΥΜΒΑΣΗ = d.ΣΥΜΒΑΣΗ,
                            ΦΥΛΟ = d.ΦΥΛΟ,
                            ΩΡΟΜΙΣΘΙΟ_ΚΩΔ = d.ΩΡΟΜΙΣΘΙΟ_ΚΩΔ,
                            ΑΝΑΘΕΣΗ_ΚΩΔ = d.ΑΝΑΘΕΣΗ_ΚΩΔ,
                            ΑΠΟΦΑΣΗ_ΚΩΔ = d.ΑΠΟΦΑΣΗ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ = d.ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ = d.ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ,
                            ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ = d.ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ
                        }).ToList();
            }
            else
            {
                data = (from d in entities.regΑΝΑΘΕΣΕΙΣ_ΠΡΟΣΛΗΨΗ
                        orderby d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ, d.ΣΧΟΛΙΚΟ_ΕΤΟΣ, d.ΕΠΩΝΥΜΙΑ
                        where d.ΜΟΝΑΔΑ != "ΕΠΑΣ" && d.ΜΟΝΑΔΑ != "ΠΕΠΑΣ"
                        select new RegAnathesiProslipsiViewModel
                        {
                            ID = d.ID,
                            ΣΧΟΛ_ΕΤΟΣ = d.ΣΧΟΛ_ΕΤΟΣ,
                            ΕΠΩΝΥΜΙΑ = d.ΕΠΩΝΥΜΙΑ,
                            ΜΟΝΑΔΑ = d.ΜΟΝΑΔΑ,
                            ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ = d.ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΑΦΜ = d.ΑΦΜ,
                            ΟΝΟΜΑΤΕΠΩΝΥΜΟ = d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ,
                            ΕΙΔΙΚΟΤΗΤΑ = d.ΕΙΔΙΚΟΤΗΤΑ,
                            ΚΛΑΔΟΣ = d.ΚΛΑΔΟΣ,
                            ΩΡΕΣ_ΕΒΔ = d.ΩΡΕΣ_ΕΒΔ,
                            ΩΡΟΜΙΣΘΙΟ = d.ΩΡΟΜΙΣΘΙΟ,
                            ΦΥΛΟ_ΛΕΚΤΙΚΟ = d.ΦΥΛΟ_ΛΕΚΤΙΚΟ,
                            ΣΥΜΒΑΣΗ_ΕΙΔΟΣ = d.ΣΥΜΒΑΣΗ_ΕΙΔΟΣ,
                            ΑΠΟΦΑΣΗ_ΕΙΔΟΣ = d.ΑΠΟΦΑΣΗ_ΕΙΔΟΣ,
                            ΗΜΝΙΑ_ΣΥΝΤΑΞΗ = d.ΗΜΝΙΑ_ΣΥΝΤΑΞΗ,
                            ΠΑΤΡΩΝΥΜΟ = d.ΠΑΤΡΩΝΥΜΟ,
                            ΣΧΟΛΗ = d.ΣΧΟΛΗ,
                            ΣΧΟΛΙΚΟ_ΕΤΟΣ = d.ΣΧΟΛΙΚΟ_ΕΤΟΣ,
                            ΚΛΑΔΟΣ_ΚΩΔ = d.ΚΛΑΔΟΣ_ΚΩΔ,
                            ΣΥΜΒΑΣΗ = d.ΣΥΜΒΑΣΗ,
                            ΦΥΛΟ = d.ΦΥΛΟ,
                            ΩΡΟΜΙΣΘΙΟ_ΚΩΔ = d.ΩΡΟΜΙΣΘΙΟ_ΚΩΔ,
                            ΑΝΑΘΕΣΗ_ΚΩΔ = d.ΑΝΑΘΕΣΗ_ΚΩΔ,
                            ΑΠΟΦΑΣΗ_ΚΩΔ = d.ΑΠΟΦΑΣΗ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ = d.ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ = d.ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ,
                            ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ = d.ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ
                        }).ToList();
            }
            return data;
        }

        public IEnumerable<RegAnathesiProslipsiViewModel> ReadSchool(int schoolId, int schoolyearId = 0)
        {
            List<RegAnathesiProslipsiViewModel> data = new List<RegAnathesiProslipsiViewModel>();

            if (schoolyearId > 0)
            {
                data = (from d in entities.regΑΝΑΘΕΣΕΙΣ_ΠΡΟΣΛΗΨΗ
                        orderby d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ, d.ΣΧΟΛΙΚΟ_ΕΤΟΣ, d.ΕΠΩΝΥΜΙΑ
                        where d.ΣΧΟΛΗ == schoolId && d.ΣΧΟΛΙΚΟ_ΕΤΟΣ == schoolyearId
                        select new RegAnathesiProslipsiViewModel
                        {
                            ID = d.ID,
                            ΣΧΟΛ_ΕΤΟΣ = d.ΣΧΟΛ_ΕΤΟΣ,
                            ΕΠΩΝΥΜΙΑ = d.ΕΠΩΝΥΜΙΑ,
                            ΜΟΝΑΔΑ = d.ΜΟΝΑΔΑ,
                            ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ = d.ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΑΦΜ = d.ΑΦΜ,
                            ΟΝΟΜΑΤΕΠΩΝΥΜΟ = d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ,
                            ΕΙΔΙΚΟΤΗΤΑ = d.ΕΙΔΙΚΟΤΗΤΑ,
                            ΚΛΑΔΟΣ = d.ΚΛΑΔΟΣ,
                            ΩΡΕΣ_ΕΒΔ = d.ΩΡΕΣ_ΕΒΔ,
                            ΩΡΟΜΙΣΘΙΟ = d.ΩΡΟΜΙΣΘΙΟ,
                            ΦΥΛΟ_ΛΕΚΤΙΚΟ = d.ΦΥΛΟ_ΛΕΚΤΙΚΟ,
                            ΣΥΜΒΑΣΗ_ΕΙΔΟΣ = d.ΣΥΜΒΑΣΗ_ΕΙΔΟΣ,
                            ΑΠΟΦΑΣΗ_ΕΙΔΟΣ = d.ΑΠΟΦΑΣΗ_ΕΙΔΟΣ,
                            ΗΜΝΙΑ_ΣΥΝΤΑΞΗ = d.ΗΜΝΙΑ_ΣΥΝΤΑΞΗ,
                            ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ = d.ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ,
                            ΔΙΑΧΕΙΡΙΣΤΗΣ = d.ΔΙΑΧΕΙΡΙΣΤΗΣ,
                            ΠΑΤΡΩΝΥΜΟ = d.ΠΑΤΡΩΝΥΜΟ,
                            ΣΧΟΛΗ = d.ΣΧΟΛΗ,
                            ΣΧΟΛΙΚΟ_ΕΤΟΣ = d.ΣΧΟΛΙΚΟ_ΕΤΟΣ,
                            ΚΛΑΔΟΣ_ΚΩΔ = d.ΚΛΑΔΟΣ_ΚΩΔ,
                            ΣΥΜΒΑΣΗ = d.ΣΥΜΒΑΣΗ,
                            ΦΥΛΟ = d.ΦΥΛΟ,
                            ΩΡΟΜΙΣΘΙΟ_ΚΩΔ = d.ΩΡΟΜΙΣΘΙΟ_ΚΩΔ,
                            ΑΝΑΘΕΣΗ_ΚΩΔ = d.ΑΝΑΘΕΣΗ_ΚΩΔ,
                            ΑΠΟΦΑΣΗ_ΚΩΔ = d.ΑΠΟΦΑΣΗ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ = d.ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ = d.ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ,
                            ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ = d.ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ
                        }).ToList();
            }
            else
            {
                data = (from d in entities.regΑΝΑΘΕΣΕΙΣ_ΠΡΟΣΛΗΨΗ
                        orderby d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ, d.ΣΧΟΛΙΚΟ_ΕΤΟΣ, d.ΕΠΩΝΥΜΙΑ
                        where d.ΣΧΟΛΗ == schoolId
                        select new RegAnathesiProslipsiViewModel
                        {
                            ID = d.ID,
                            ΣΧΟΛ_ΕΤΟΣ = d.ΣΧΟΛ_ΕΤΟΣ,
                            ΕΠΩΝΥΜΙΑ = d.ΕΠΩΝΥΜΙΑ,
                            ΜΟΝΑΔΑ = d.ΜΟΝΑΔΑ,
                            ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ = d.ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΑΦΜ = d.ΑΦΜ,
                            ΟΝΟΜΑΤΕΠΩΝΥΜΟ = d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ,
                            ΕΙΔΙΚΟΤΗΤΑ = d.ΕΙΔΙΚΟΤΗΤΑ,
                            ΚΛΑΔΟΣ = d.ΚΛΑΔΟΣ,
                            ΩΡΕΣ_ΕΒΔ = d.ΩΡΕΣ_ΕΒΔ,
                            ΩΡΟΜΙΣΘΙΟ = d.ΩΡΟΜΙΣΘΙΟ,
                            ΦΥΛΟ_ΛΕΚΤΙΚΟ = d.ΦΥΛΟ_ΛΕΚΤΙΚΟ,
                            ΣΥΜΒΑΣΗ_ΕΙΔΟΣ = d.ΣΥΜΒΑΣΗ_ΕΙΔΟΣ,
                            ΑΠΟΦΑΣΗ_ΕΙΔΟΣ = d.ΑΠΟΦΑΣΗ_ΕΙΔΟΣ,
                            ΗΜΝΙΑ_ΣΥΝΤΑΞΗ = d.ΗΜΝΙΑ_ΣΥΝΤΑΞΗ,
                            ΠΑΤΡΩΝΥΜΟ = d.ΠΑΤΡΩΝΥΜΟ,
                            ΣΧΟΛΗ = d.ΣΧΟΛΗ,
                            ΣΧΟΛΙΚΟ_ΕΤΟΣ = d.ΣΧΟΛΙΚΟ_ΕΤΟΣ,
                            ΚΛΑΔΟΣ_ΚΩΔ = d.ΚΛΑΔΟΣ_ΚΩΔ,
                            ΣΥΜΒΑΣΗ = d.ΣΥΜΒΑΣΗ,
                            ΦΥΛΟ = d.ΦΥΛΟ,
                            ΩΡΟΜΙΣΘΙΟ_ΚΩΔ = d.ΩΡΟΜΙΣΘΙΟ_ΚΩΔ,
                            ΑΝΑΘΕΣΗ_ΚΩΔ = d.ΑΝΑΘΕΣΗ_ΚΩΔ,
                            ΑΠΟΦΑΣΗ_ΚΩΔ = d.ΑΠΟΦΑΣΗ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ = d.ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ = d.ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ,
                            ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ = d.ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ
                        }).ToList();
            }
            return data;
        }

        public RegAnathesiProslipsiViewModel GetRecord(int entityId)
        {
            var data = (from d in entities.regΑΝΑΘΕΣΕΙΣ_ΠΡΟΣΛΗΨΗ
                        where d.ID == entityId
                        select new RegAnathesiProslipsiViewModel
                        {
                            ID = d.ID,
                            ΣΧΟΛ_ΕΤΟΣ = d.ΣΧΟΛ_ΕΤΟΣ,
                            ΕΠΩΝΥΜΙΑ = d.ΕΠΩΝΥΜΙΑ,
                            ΜΟΝΑΔΑ = d.ΜΟΝΑΔΑ,
                            ΑΦΜ = d.ΑΦΜ,
                            ΟΝΟΜΑΤΕΠΩΝΥΜΟ = d.ΟΝΟΜΑΤΕΠΩΝΥΜΟ,
                            ΕΙΔΙΚΟΤΗΤΑ = d.ΕΙΔΙΚΟΤΗΤΑ,
                            ΩΡΕΣ_ΕΒΔ = d.ΩΡΕΣ_ΕΒΔ,
                            ΠΑΤΡΩΝΥΜΟ = d.ΠΑΤΡΩΝΥΜΟ,
                            ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ = d.ΕΠΩΝΥΜΙΑ_ΠΕΡΙΦΕΡΕΙΑ,
                            ΑΠΟΦΑΣΗ_ΕΙΔΟΣ = d.ΑΠΟΦΑΣΗ_ΕΙΔΟΣ,
                            ΗΜΝΙΑ_ΣΥΝΤΑΞΗ = d.ΗΜΝΙΑ_ΣΥΝΤΑΞΗ,
                            ΚΛΑΔΟΣ = d.ΚΛΑΔΟΣ,
                            ΩΡΟΜΙΣΘΙΟ = d.ΩΡΟΜΙΣΘΙΟ,
                            ΦΥΛΟ_ΛΕΚΤΙΚΟ = d.ΦΥΛΟ_ΛΕΚΤΙΚΟ,
                            ΣΥΜΒΑΣΗ_ΕΙΔΟΣ = d.ΣΥΜΒΑΣΗ_ΕΙΔΟΣ,
                            ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ = d.ΑΠΟΦΑΣΗ_ΠΡΩΤΟΚΟΛΛΟ,
                            ΔΙΑΧΕΙΡΙΣΤΗΣ = d.ΔΙΑΧΕΙΡΙΣΤΗΣ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ = d.ΕΙΔΙΚΟΤΗΤΑ_ΕΝΙΑΙΑ,
                            ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ = d.ΠΕΡΙΦ_ΣΥΝΤΟΜΟΓΡΑΦΙΑ,
                            ΣΧΟΛΗ = d.ΣΧΟΛΗ,
                            ΣΧΟΛΙΚΟ_ΕΤΟΣ = d.ΣΧΟΛΙΚΟ_ΕΤΟΣ,
                            ΚΛΑΔΟΣ_ΚΩΔ = d.ΚΛΑΔΟΣ_ΚΩΔ,
                            ΣΥΜΒΑΣΗ = d.ΣΥΜΒΑΣΗ,
                            ΦΥΛΟ = d.ΦΥΛΟ,
                            ΩΡΟΜΙΣΘΙΟ_ΚΩΔ = d.ΩΡΟΜΙΣΘΙΟ_ΚΩΔ,
                            ΑΝΑΘΕΣΗ_ΚΩΔ = d.ΑΝΑΘΕΣΗ_ΚΩΔ,
                            ΑΠΟΦΑΣΗ_ΚΩΔ = d.ΑΠΟΦΑΣΗ_ΚΩΔ,
                            ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ = d.ΕΙΔΙΚΟΤΗΤΑ_ΚΩΔ,
                        }).FirstOrDefault();

            return (data);
        }

        public void Dispose()
        {
            entities.Dispose();
        }
    }
}